<?php

        $_statusid= array('login' =>array("zero"=>"ชื่อผู้ใช้ หรือ รหัสผ่าน ไม่ถูกต้อง",
                                          "one"=>"ชื่อผู้ใช้ของคุณยังไม่ได้รับการอนุมัติ",
                                          "two"=>"ชื่อผู้ใช้ของคุณถูกระงับชั่วคราว !"),
            'member'=>array(0=>"กรอกข้อมูลไม่ถูกต้องกรุณาตรวจสอบอีกครั้ง",
                                1=>"บันทึกข้อมูลสำเร็จ",
                                    2=>"ลบข้อมูลสำเร็จ",
                                        3=>"เพิ่มผู้ใช้ใหม่สำเร็จ",
                                            4=>"ลบไม่ได้เนื่องจากมีบันทึกข้อมูลในระบบแล้วจึงไม่อนุญาติให้ลบ"),
            'peroduct_type' => array(0 =>'กรอกข้อมูลไม่ถูกต้องกรุณาลองใหม่อีกครั้ง',
                                        1=>"บันทึกข้อมูลเข้าสู่ระบบสำเร็จ",
                                            2=>"บันทึกข้อมูลแก้ไขข้อมูลสำเร็จ",
                                                3=>"ลบข้อมูลสำเร็จ"),
            'product' => array(0=>'กรอกข้อมูลไม่ถูกต้องกรุณาลองใหม่อีกครั้ง',
                                1=>'บันทึกข้อมูลเข้าสู่ระบบสำเร็จ',
                                    2=>'บันทึกข้อมูลแก้ไขข้อมูลสำเร็จ',
                                        3=>'ลบข้อมูลสำเร็จ')
        );

        //if(isset($_POST["PAGE"])&&isset($_POST["ERROR"])){
            //$page = $_POST["PAGE"];
            //$error = $_POST["ERROR"];
            //echo ($_statusid[$page][$error]);

        //}

        if(isset($_POST["PAGE"])&&isset($_POST["ERROR"])){
            echo ($_statusid[$_POST["PAGE"]][$_POST["ERROR"]]);
        }else{

        }

?>
